#ifndef __COMMANDMANAGER_H
#define __COMMANDMANAGER_H


/***********************************************
* 功能：初始化命令管理器
***********************************************/
void CommandManager_init(void);

/***********************************************
* 功能：把接收到的命令保存到接收缓冲区
* 参数：srcCmd - 源命令
*       len - 命令长度
***********************************************/
void CommandManager_saveReceivedCmd(uint8* srcCmd,uint16 len);

/***********************************************
* 功能：命令管理器工作函数-在主循环中调用
***********************************************/
void CommandManager_process(void);

/***********************************************
* 功能：获得准备发送的数据
* 参数：buf - 存放数据的目标缓冲区
* 返回：数据长度
***********************************************/
uint16 CommandManager_getSendingCmd(uint8* buf);

/***********************************************
* 功能：重置命令管理器
***********************************************/
void CommandManager_reset(void);

#endif