#ifndef	__BATTERY_H
#define	__BATTERY_H

#include "type.h"
/*电池电量等级*/
#define BATTERY_DANGER 	 		0       /*电池电量极低，软件阻止开机*/
#define BATTERY_LOW     		1       /*电池电量低，不足以工作24小时*/
#define BATTERY_MIDDLE  		2       /*电池电量中等*/
#define BATTERY_HIGH    		3       /*电池电量充足*/

#define BATTERY_IS_CHARGING 	1		/*电池正在充电*/
#define BATTERY_IS_FULL			0		/*电池已经充满*/

#define	ADC_STATE_IDLE	0
#define	ADC_STATE_BUSY	1

/***********************************************
* 功能：更新电池电量信息
***********************************************/
void Battery_update(void);

/***********************************************
* 功能：获取电池电量等级
***********************************************/
uint8 Battery_getBatteryLevel(void);

/***********************************************
* 功能：充电检测端口打开
***********************************************/
void Battery_openChargePort(void);

/***********************************************
* 功能：充电检测端口关闭
***********************************************/
void Battery_closeChargePort(void);

/***********************************************
* 功能：判断电池充电状态
***********************************************/
uint8 Battery_isCharging(void);

/***********************************************
* 功能：关闭电池电压检测功能
***********************************************/
void Battery_disable(void);

/***********************************************
* 功能：电池电量检测
***********************************************/
void Battery_check(void);


#endif