#ifndef	__INNEREEPROM_H
#define	__INNEREEPROM_H

#include "Type.h"

/*******************************************************************************
*内部EEPROM，向指定地址写入num个字节*
*******************************************************************************/
void InnerEEPROM_write(const uint8 *data,uint32 addr,uint32 length);

/*******************************************************************************
*内部EEPROM，从指定地址读取num个字节*
*******************************************************************************/
void InnerEEPROM_read(uint32 src,uint8 *des,uint32 num);


#endif