#ifndef __SYSTEM_H
#define __SYSTEM_H

#include "type.h"

/**********************************************/
//A20设备信息
extern const uint8 deviceType;
extern const uint8 version_issued[13];
extern const uint8 version_developer[13];
/***********************************************
* 功能：开平方运算
* 参数：a - 被开方数
* 返回：结果
***********************************************/
uint16 System_sqrt(uint32 a);

/***********************************************
* 功能：毫秒级延时
* 参数：ms - 要延时的时间(毫秒)
***********************************************/
void System_delay(uint16 ms);

/***********************************************
* 功能：更新看门狗
***********************************************/
void System_updateWatchDog(void);

/***********************************************
* 功能：关闭所有I/O
***********************************************/
void System_disablePin(void);

/***********************************************
*功能:系统初始化
***********************************************/
void System_init(void);


#endif